RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_hard_i2c.c
/*
 * Copyright (c) 2006-2024, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2024-02-17     Dyyt587   first version
 * 2024-04-23     Zeidan    fix bugs, test on STM32F429IGTx
 * 2024-12-10     zzk597    add support for STM32F1 series
 * 2024-06-23     wdfk-prog Add blocking modes and distinguish POLL,INT,DMA modes
 */

#include "drv_hard_i2c.h"

#if defined(BSP_HARDWARE_I2C)

// #define DRV_DEBUG
#define LOG_TAG "drv.i2c.hw"
#include <drv_log.h>

/* only buffer length >= DMA_TRANS_MIN_LEN will use DMA mode */
#define DMA_TRANS_MIN_LEN 2

typedef enum
{
#ifdef BSP_USING_HARD_I2C1
    I2C1_INDEX,
#endif /* BSP_USING_HARD_I2C1 */
#ifdef BSP_USING_HARD_I2C2
    I2C2_INDEX,
#endif /* BSP_USING_HARD_I2C2 */
#ifdef BSP_USING_HARD_I2C3
    I2C3_INDEX,
#endif /* BSP_USING_HARD_I2C3 */
#ifdef BSP_USING_HARD_I2C4
    I2C4_INDEX,
#endif /* BSP_USING_HARD_I2C4 */
}i2c_index_t;

static struct stm32_i2c_config i2c_config[] =
{
#ifdef BSP_USING_HARD_I2C1
        I2C1_BUS_CONFIG,
#endif /* BSP_USING_HARD_I2C1 */
#ifdef BSP_USING_HARD_I2C2
        I2C2_BUS_CONFIG,
#endif /* BSP_USING_HARD_I2C2 */
#ifdef BSP_USING_HARD_I2C3
        I2C3_BUS_CONFIG,
#endif /* BSP_USING_HARD_I2C3 */
#ifdef BSP_USING_HARD_I2C4
        I2C4_BUS_CONFIG,
#endif /* BSP_USING_HARD_I2C4 */
};

static struct stm32_i2c i2c_objs[sizeof(i2c_config) / sizeof(i2c_config[0])] = {0};

static rt_err_t stm32_i2c_init(struct stm32_i2c *i2c_drv)
{
    RT_ASSERT(i2c_drv != RT_NULL);

    I2C_HandleTypeDef *i2c_handle = &i2c_drv->handle;
    struct stm32_i2c_config *cfg = i2c_drv->config;

    rt_memset(i2c_handle, 0, sizeof(I2C_HandleTypeDef));
    i2c_handle->Instance = cfg->Instance;
#if defined(SOC_SERIES_STM32H7)
    i2c_handle->Init.Timing = cfg->timing;
    i2c_handle->Init.OwnAddress2Masks = I2C_OA2_NOMASK;
#else
    i2c_handle->Init.ClockSpeed = 100000;
    i2c_handle->Init.DutyCycle = I2C_DUTYCYCLE_2;
#endif /* defined(SOC_SERIES_STM32H7) */
    i2c_handle->Init.OwnAddress1 = 0;
    i2c_handle->Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    i2c_handle->Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    i2c_handle->Init.OwnAddress2 = 0;
    i2c_handle->Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    i2c_handle->Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
    if (HAL_I2C_DeInit(i2c_handle) != HAL_OK)
    {
        return -RT_EFAULT;
    }

    if (HAL_I2C_Init(i2c_handle) != HAL_OK)
    {
        return -RT_EFAULT;
    }
#if defined(SOC_SERIES_STM32H7)
    /* Configure Analogue filter */
    if (HAL_I2CEx_ConfigAnalogFilter(i2c_handle, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
    {
        return -RT_EFAULT;
    }

    /* Configure Digital filter */
    if (HAL_I2CEx_ConfigDigitalFilter(i2c_handle, 0) != HAL_OK)
    {
        return -RT_EFAULT;
    }
#endif /* defined(SOC_SERIES_STM32H7) */
#if defined(BSP_I2C_RX_USING_DMA)
    /* I2C2 DMA Init */
    if (i2c_drv->i2c_dma_flag & RT_DEVICE_FLAG_DMA_RX)
    {
        HAL_DMA_Init(&i2c_drv->dma.handle_rx);

        __HAL_LINKDMA(&i2c_drv->handle, hdmarx, i2c_drv->dma.handle_rx);

        /* NVIC configuration for DMA transfer complete interrupt */
        HAL_NVIC_SetPriority(i2c_drv->config->dma_rx->dma_irq, 0, 0);
        HAL_NVIC_EnableIRQ(i2c_drv->config->dma_rx->dma_irq);
    }
#endif /* defined(BSP_I2C_RX_USING_DMA) */
#if defined(BSP_I2C_TX_USING_DMA)
    if (i2c_drv->i2c_dma_flag & RT_DEVICE_FLAG_DMA_TX)
    {
        HAL_DMA_Init(&i2c_drv->dma.handle_tx);

        __HAL_LINKDMA(&i2c_drv->handle, hdmatx, i2c_drv->dma.handle_tx);

        /* NVIC configuration for DMA transfer complete interrupt */
        HAL_NVIC_SetPriority(i2c_drv->config->dma_tx->dma_irq, 1, 0);
        HAL_NVIC_EnableIRQ(i2c_drv->config->dma_tx->dma_irq);
    }
#endif /* defined(BSP_I2C_TX_USING_DMA) */
#if defined(BSP_I2C_USING_IRQ)
    if ((i2c_drv->i2c_dma_flag & RT_DEVICE_FLAG_DMA_TX || i2c_drv->i2c_dma_flag & RT_DEVICE_FLAG_DMA_RX)
    || (i2c_drv->i2c_dma_flag & RT_DEVICE_FLAG_INT_TX || i2c_drv->i2c_dma_flag & RT_DEVICE_FLAG_INT_RX))
    {
        /* In the data transfer function stm32_i2c_master_xfer(), the IT transfer function
        HAL_I2C_Master_Seq_Transmit_IT() is used when DMA is not used, so the IT interrupt
        must be enable anyway, regardless of the DMA configuration, otherwise
        the rt_completion_wait() will always timeout. */
        HAL_NVIC_SetPriority(i2c_drv->config->evirq_type, 2, 0);
        HAL_NVIC_EnableIRQ(i2c_drv->config->evirq_type);
    }
#endif /* defined(BSP_I2C_USING_IRQ) */

    return RT_EOK;
}

static rt_err_t stm32_i2c_configure(struct rt_i2c_bus_device *bus)
{
    RT_ASSERT(RT_NULL != bus);
    struct stm32_i2c *i2c_drv = rt_container_of(bus, struct stm32_i2c, i2c_bus);

    return stm32_i2c_init(i2c_drv);
}

/**
 * @brief Start one master receive transfer and report whether wait is required.
 * @param i2c_obj Pointer to the STM32 I2C driver object.
 * @param handle Pointer to the HAL I2C handle.
 * @param msg Pointer to the RT-Thread I2C message descriptor.
 * @param mode HAL sequential transfer mode.
 * @param timeout Timeout in RT-Thread ticks for polling transfer.
 * @param need_wait Output flag set to RT_TRUE when IT/DMA path is used.
 * @return HAL status returned by the selected HAL receive API.
 * @retval HAL_OK Transfer start succeeded.
 * @retval HAL_ERROR Transfer start failed or no receive backend is enabled.
 */
static HAL_StatusTypeDef stm32_i2c_master_receive_start(struct stm32_i2c *i2c_obj,
                                                        I2C_HandleTypeDef *handle,
                                                        struct rt_i2c_msg *msg,
                                                        uint32_t mode,
                                                        rt_uint32_t timeout,
                                                        rt_bool_t *need_wait)
{
    RT_UNUSED(i2c_obj);
    RT_UNUSED(mode);
    RT_UNUSED(timeout);
    RT_ASSERT(i2c_obj != RT_NULL);
    RT_ASSERT(handle != RT_NULL);
    RT_ASSERT(msg != RT_NULL);
    RT_ASSERT(need_wait != RT_NULL);

    *need_wait = RT_FALSE;

#if defined(BSP_I2C_RX_USING_DMA)
    if ((i2c_obj->i2c_dma_flag & RT_DEVICE_FLAG_DMA_RX) && (msg->len >= DMA_TRANS_MIN_LEN))
    {
        *need_wait = RT_TRUE;
        return HAL_I2C_Master_Seq_Receive_DMA(handle, (msg->addr << 1), msg->buf, msg->len, mode);
    }
#endif /* defined(BSP_I2C_RX_USING_DMA) */

#if defined(BSP_I2C_RX_USING_INT)
    if (i2c_obj->i2c_dma_flag & RT_DEVICE_FLAG_INT_RX)
    {
        *need_wait = RT_TRUE;
        return HAL_I2C_Master_Seq_Receive_IT(handle, (msg->addr << 1), msg->buf, msg->len, mode);
    }
#endif /* defined(BSP_I2C_RX_USING_INT) */

#if defined(BSP_I2C_RX_USING_POLL)
    return HAL_I2C_Master_Receive(handle, (msg->addr << 1), msg->buf, msg->len, timeout);
#else
    return HAL_ERROR;
#endif /* defined(BSP_I2C_RX_USING_POLL) */
}

/**
 * @brief Start one master transmit transfer and report whether wait is required.
 * @param i2c_obj Pointer to the STM32 I2C driver object.
 * @param handle Pointer to the HAL I2C handle.
 * @param msg Pointer to the RT-Thread I2C message descriptor.
 * @param mode HAL sequential transfer mode.
 * @param timeout Timeout in RT-Thread ticks for polling transfer.
 * @param need_wait Output flag set to RT_TRUE when IT/DMA path is used.
 * @return HAL status returned by the selected HAL transmit API.
 * @retval HAL_OK Transfer start succeeded.
 * @retval HAL_ERROR Transfer start failed or no transmit backend is enabled.
 */
static HAL_StatusTypeDef stm32_i2c_master_transmit_start(struct stm32_i2c *i2c_obj,
                                                         I2C_HandleTypeDef *handle,
                                                         struct rt_i2c_msg *msg,
                                                         uint32_t mode,
                                                         rt_uint32_t timeout,
                                                         rt_bool_t *need_wait)
{
    RT_UNUSED(i2c_obj);
    RT_UNUSED(mode);
    RT_UNUSED(timeout);
    RT_ASSERT(i2c_obj != RT_NULL);
    RT_ASSERT(handle != RT_NULL);
    RT_ASSERT(msg != RT_NULL);
    RT_ASSERT(need_wait != RT_NULL);

    *need_wait = RT_FALSE;

#if defined(BSP_I2C_TX_USING_DMA)
    if ((i2c_obj->i2c_dma_flag & RT_DEVICE_FLAG_DMA_TX) && (msg->len >= DMA_TRANS_MIN_LEN))
    {
        *need_wait = RT_TRUE;
        return HAL_I2C_Master_Seq_Transmit_DMA(handle, (msg->addr << 1), msg->buf, msg->len, mode);
    }
#endif /* defined(BSP_I2C_TX_USING_DMA) */

#if defined(BSP_I2C_TX_USING_INT)
    if (i2c_obj->i2c_dma_flag & RT_DEVICE_FLAG_INT_TX)
    {
        *need_wait = RT_TRUE;
        return HAL_I2C_Master_Seq_Transmit_IT(handle, (msg->addr << 1), msg->buf, msg->len, mode);
    }
#endif /* defined(BSP_I2C_TX_USING_INT) */

#if defined(BSP_I2C_TX_USING_POLL)
    return HAL_I2C_Master_Transmit(handle, (msg->addr << 1), msg->buf, msg->len, timeout);
#else
    return HAL_ERROR;
#endif /* defined(BSP_I2C_TX_USING_POLL) */
}

/**
 * @brief Compute HAL transfer mode for the current message in a sequence.
 * @param index Index of the current message.
 * @param msg Pointer to the current I2C message.
 * @param next_msg Pointer to the next I2C message, or RT_NULL for the last one.
 * @param is_last RT_TRUE when the current message is the last frame.
 * @return HAL sequential transfer option used by the message.
 * @retval I2C_FIRST_AND_NEXT_FRAME Continue transfer without repeated start.
 * @retval I2C_LAST_FRAME_NO_STOP Keep bus active for following frame semantics.
 * @retval I2C_LAST_FRAME End transfer with the last frame behavior.
 */
static uint32_t stm32_i2c_get_xfer_mode(rt_int32_t index,
                                        struct rt_i2c_msg *msg,
                                        struct rt_i2c_msg *next_msg,
                                        rt_bool_t is_last)
{
    if (is_last)
    {
        if (msg->flags & RT_I2C_NO_STOP)
        {
            return I2C_LAST_FRAME_NO_STOP;
        }

        return I2C_LAST_FRAME;
    }

    if (next_msg->flags & RT_I2C_NO_START)
    {
        if ((next_msg->flags & RT_I2C_RD) == (msg->flags & RT_I2C_RD))
        {
            /* The same mode, can use no start */
            return I2C_FIRST_AND_NEXT_FRAME;
        }

        /* Not allowed to use no start, sending address is required when changing direction, user setting error */
        LOG_W("user set flags error msg[%d] flags RT_I2C_NO_START has canceled", index + 1);
    }

    return I2C_LAST_FRAME_NO_STOP;
}

/**
 * @brief Convert HAL transfer mode value to a readable log string.
 * @param mode HAL sequential transfer option.
 * @return Constant string for logging.
 */
const char *stm32_i2c_mode_name(uint32_t mode)
{
    switch (mode)
    {
    case I2C_FIRST_AND_NEXT_FRAME:
        return "I2C_FIRST_AND_NEXT_FRAME";
    case I2C_LAST_FRAME_NO_STOP:
        return "I2C_FIRST_FRAME/I2C_LAST_FRAME_NO_STOP";
    case I2C_LAST_FRAME:
        return "I2C_LAST_FRAME";
    default:
        return "unknown mode";
    }
}
/**
 * @brief Hardware I2C driver transfer
 *
 * @param bus Device bus
 * @param msgs Data to be transferred
 * @param num Number of data
 * @return rt_ssize_t Transfer status
 */
static rt_ssize_t stm32_i2c_master_xfer(struct rt_i2c_bus_device *bus,
                                        struct rt_i2c_msg msgs[],
                                        rt_uint32_t num)
{
    rt_uint32_t i = 0;
    rt_int32_t ret = 0;
    struct rt_i2c_msg *msg = RT_NULL;
    struct rt_i2c_msg *next_msg = RT_NULL;
    struct stm32_i2c *i2c_obj;
    rt_bool_t is_last = RT_FALSE;
    uint32_t mode = 0;
    rt_uint32_t timeout;
    if (num == 0)
    {
        return 0;
    }

    RT_ASSERT((msgs != RT_NULL) && (bus != RT_NULL));
    i2c_obj = rt_container_of(bus, struct stm32_i2c, i2c_bus);
    RT_ASSERT(i2c_obj != RT_NULL);
    I2C_HandleTypeDef *handle = &i2c_obj->handle;
    RT_ASSERT(handle != RT_NULL);
#if defined(BSP_I2C_USING_IRQ)
    struct rt_completion *completion;
    completion = &i2c_obj->completion;
#endif /* defined(BSP_I2C_USING_IRQ) */
    LOG_D("xfer start %d megs", num);

    rt_uint32_t freq_khz = bus->config.usage_freq / 1000;
    if (freq_khz == 0)
    {
        freq_khz = 1;
    }

    for (i = 0; i < num; i++)
    {
        rt_bool_t need_wait = RT_FALSE;
        msg = &msgs[i];
        is_last = (i == (num - 1));
        next_msg = is_last ? RT_NULL : &msgs[i + 1];
        mode = stm32_i2c_get_xfer_mode(i, msg, next_msg, is_last);
        LOG_D("xfer       msgs[%d] addr=0x%2x buf=0x%x len= 0x%x flags= 0x%x", i, msg->addr, msg->buf, msg->len, msg->flags);

        // timeout= data_time + dev_addr_time + reserve_time
        timeout = (msg->len * 8) / freq_khz + 1 + 5;

        if (msg->flags & RT_I2C_RD)
        {
            LOG_D("xfer  rec  msgs[%d] hal mode = %s", i, stm32_i2c_mode_name(mode));
            ret = stm32_i2c_master_receive_start(i2c_obj, handle, msg, mode, timeout, &need_wait);
            if (ret != HAL_OK)
            {
                LOG_E("I2C[%s] Read error(%d)!\n", bus->parent.parent.name, ret);
                goto out;
            }
#if defined(BSP_I2C_USING_IRQ)
            if (need_wait)
            {
                ret = rt_completion_wait(completion, timeout);
                if (ret != RT_EOK)
                {
                    LOG_W("I2C[%s] receive wait failed %d, timeout %d", bus->parent.parent.name, ret, timeout);
                    goto out;
                }
            }
#endif /* defined(BSP_I2C_USING_IRQ) */
        }
        else
        {
            LOG_D("xfer trans msgs[%d] hal mode = %s", i, stm32_i2c_mode_name(mode));
            ret = stm32_i2c_master_transmit_start(i2c_obj, handle, msg, mode, timeout, &need_wait);
            if (ret != HAL_OK)
            {
                LOG_E("I2C[%s] Write error(%d)!\n", bus->parent.parent.name, ret);
                goto out;
            }
#if defined(BSP_I2C_USING_IRQ)
            if (need_wait)
            {
                ret = rt_completion_wait(completion, timeout);
                if (ret != RT_EOK)
                {
                    LOG_W("I2C[%s] transmit wait failed %d, timeout %d", bus->parent.parent.name, ret, timeout);
                    goto out;
                }
            }
#endif /* defined(BSP_I2C_USING_IRQ) */
        }
        if (!is_last)
        {
            LOG_D("xfer  next msgs[%d] addr=0x%2x buf= 0x%x len= 0x%x flags = 0x%x\r\n", i + 1, next_msg->addr, next_msg->buf, next_msg->len, next_msg->flags);
        }
    }
    ret = num;
    LOG_D("xfer  end  %d megs\r\n", num);
    return ret;

out:
    ret = i;
    /*
    * On STM32H7, STOPI only enables STOP-event interrupt handling.
    * It does not actively generate a STOP condition on the bus.
    *
    * For non-H7 STM32 series, the legacy HAL error handler already
    * generates a STOP condition on AF in master/memory modes, so
    * this driver does not manually issue another STOP in the AF path.
    */
    if (handle->ErrorCode & HAL_I2C_ERROR_AF)
    {
        LOG_W("I2C[%s] NACK Error", bus->parent.parent.name);
#if defined(SOC_SERIES_STM32H7)
        handle->Instance->CR1 |= I2C_IT_STOPI;
#endif  /* defined(SOC_SERIES_STM32H7) */
    }
    if (handle->ErrorCode & HAL_I2C_ERROR_BERR)
    {
        LOG_W("I2C[%s] BUS Error", bus->parent.parent.name);
#if defined(SOC_SERIES_STM32H7)
        handle->Instance->CR1 |= I2C_IT_STOPI;
#else
        handle->Instance->CR1 |= I2C_CR1_STOP;
#endif  /* defined(SOC_SERIES_STM32H7) */
    }

    return ret;
}

